cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_addRoutePattern_CUC.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/11.5">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:addRoutePattern sequence="?">
         <routePattern>
            <pattern>2000</pattern>
            <destination>
               <!--You have a CHOICE of the next 2 items at this level-->
               <gatewayName uuid="?">UCM-CUC-SIP-Trunk</gatewayName>
            </destination>
         </routePattern>
      </ns:addRoutePattern>
   </soapenv:Body>
</soapenv:Envelope>